Revit 2024 API
BuiltInFailures.ViewFailures.ZeroLengthViewRegionsRemoved Property
 Some View Regions were removed. When the size of a View Region becomes zero, it is removed from the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ZeroLengthViewRegionsRemoved { get; }
Visual Basic
Public Shared ReadOnly Property ZeroLengthViewRegionsRemoved As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ZeroLengthViewRegionsRemoved {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace